Execution result of `run-all plan` in `infrastructure/cloud` :
```
time=2023-10-14T16:20:15Z level=info msg=The stack at /github/workspace/infrastructure/cloud will be processed in the following order for command plan:
Group 1
- Module /github/workspace/infrastructure/cloud/cloudflare/access



Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of cloudflare/cloudflare from the dependency lock file
- Reusing previous version of integrations/github from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing cloudflare/cloudflare v4.16.0...
- Installed cloudflare/cloudflare v4.16.0 (self-signed, key ID C76001609EE3B136)
- Installing integrations/github v5.40.0...
- Installed integrations/github v5.40.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)
- Installing hashicorp/aws v5.21.0...
- Installed hashicorp/aws v5.21.0 (signed by HashiCorp)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!
data.github_ip_ranges.this: Reading...
data.github_ip_ranges.this: Read complete after 0s [id=github-ip-ranges]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_access_application.this will be created
  + resource "cloudflare_access_application" "this" {
      + account_id                = (known after apply)
      + app_launcher_visible      = true
      + aud                       = (known after apply)
      + auto_redirect_to_identity = false
      + domain                    = (sensitive value)
      + enable_binding_cookie     = false
      + id                        = (known after apply)
      + name                      = (sensitive value)
      + service_auth_401_redirect = false
      + session_duration          = "24h"
      + skip_interstitial         = false
      + type                      = "self_hosted"
      + zone_id                   = (sensitive value)
    }

  # cloudflare_access_policy.this will be created
  + resource "cloudflare_access_policy" "this" {
      + account_id     = (known after apply)
      + application_id = (known after apply)
      + decision       = "bypass"
      + id             = (known after apply)
      + name           = "IP List"
      + precedence     = 1
      + zone_id        = (sensitive value)

      + include {
          + ip = (sensitive value)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
    